<center>
<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/module_1/images/SN_web_lightmode.png" width="300"> 
</center>

# Assignment: Exploratory Data Analysis with SQL
Estimated time needed: 60 minutes


# Introduction
Using this R notebook you will perform exploratory data analysis using SQL queries with the RSQLite R package. You will be graded on the accuracy of your results as well as the content of your SQL queries.

### Establish your SQlIte connection
Load the 'RSQLite' library, and use the 'dbConnect( )' function as you did in the previous lab to establish the connection to your SQLite database.  
You are now ready to start running SQL queries using the RSQLite library as you did in Course 3.

In [2]:
# provide your solution here
install.packages("RSQLite")

also installing the dependencies ‘fastmap’, ‘bit’, ‘rlang’, ‘cachem’, ‘bit64’, ‘blob’, ‘DBI’, ‘memoise’, ‘cpp11’

Updating HTML index of packages in '.Library'
Making 'packages.html' ... done

In [1]:
library("RSQLite")

In [2]:
# Establish Connection
conn <- dbConnect(RSQLite::SQLite(),"Capstone.sqlite")
conn

<SQLiteConnection>
  Path: /resources/labs/FinalRSQLite/Capstone.sqlite
  Extensions: TRUE

Download the following csv files:

*   [WORLD_CITIES](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/world_cities.csv)

*   [BIKE_SHARING_SYSTEMS](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/bike_sharing_systems.csv)

*   [CITIES_WEATHER_FORECAST](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/cities_weather_forecast.csv)

*   [SEOUL_BIKE_SHARING](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/seoul_bike_sharing.csv)

and load the csv's  into 4 tables as mentioned below
* SEOUL_BIKE_SHARING

* CITIES_WEATHER_FORECAST

* BIKE_SHARING_SYSTEMS 

*  WORLD_CITIES

> Hint : Use the read_csv() function and dbWriteTable() functions

In [3]:
# read file
world_cities <- read.csv("world_cities.csv")
head(world_cities)

bike_sharing_systems <- read.csv("bike_sharing_systems.csv")
head(bike_sharing_systems)

cities_weather_forecast <- read.csv("cities_weather_forecast.csv")
head(cities_weather_forecast)

seoul_bike_sharing <- read.csv("seoul_bike_sharing.csv")
head(seoul_bike_sharing)

  CITY     CITY_ASCII LAT     LNG      COUNTRY     ISO2 ISO3 ADMIN_NAME
1 Tokyo    Tokyo      35.6897 139.6922 Japan       JP   JPN  Tōkyō
2 Jakarta  Jakarta    -6.2146 106.8451 Indonesia   ID   IDN  Jakarta
3 Delhi    Delhi      28.6600  77.2300 India       IN   IND  Delhi
4 Mumbai   Mumbai     18.9667  72.8333 India       IN   IND  Mahārāshtra
5 Manila   Manila     14.5958 120.9772 Philippines PH   PHL  Manila
6 Shanghai Shanghai   31.1667 121.4667 China       CN   CHN  Shanghai
  CAPITAL POPULATION ID
1 primary 37977000   1392685764
2 primary 34540000   1360771077
3 admin   29617000   1356872604
4 admin   23355000   1356226629
5 primary 23088000   1608618140
6 admin   22120000   1156073548

  COUNTRY   CITY                  SYSTEM         BICYCLES
1 Albania   Tirana                NA              200
2 Argentina Mendoza               NA               40
3 Argentina San Lorenzo, Santa Fe Biciudad         80
4 Argentina Buenos Aires          Serttel Brasil 4000
5 Argentina Rosario               NA              480
6 Australia Melbourne             PBSC & 8D       676

  CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clear   10000      12.32 10.91    12.32    1015     50       2.18
2 Seoul Clear   10000      11.48  9.81    11.48    1016     48       1.25
3 Seoul Clouds  10000       9.99  8.82     9.99    1015     46       0.94
4 Seoul Clouds  10000       7.87  7.87     7.87    1014     46       0.83
5 Seoul Clouds  10000      10.09 10.09    10.09    1014     37       1.96
6 Seoul Rain    10000       9.74  9.74     9.74    1014     48       3.24
  WIND_DEG SEASON FORECAST_DATETIME
1 248      Spring 2021-04-16 12:00:00
2 142      Spring 2021-04-16 15:00:00
3 130      Spring 2021-04-16 18:00:00
4  31      Spring 2021-04-16 21:00:00
5 309      Spring 2021-04-17 00:00:00
6 267      Spring 2021-04-17 03:00:00

  DATE       RENTED_BIKE_COUNT HOUR TEMPERATURE HUMIDITY WIND_SPEED VISIBILITY
1 01/12/2017 254               0    -5.2        37       2.2        2000
2 01/12/2017 204               1    -5.5        38       0.8        2000
3 01/12/2017 173               2    -6.0        39       1.0        2000
4 01/12/2017 107               3    -6.2        40       0.9        2000
5 01/12/2017  78               4    -6.0        36       2.3        2000
6 01/12/2017 100               5    -6.4        37       1.5        2000
  DEW_POINT_TEMPERATURE SOLAR_RADIATION RAINFALL SNOWFALL SEASONS HOLIDAY
1 -17.6                 0               0        0        Winter  No Holiday
2 -17.6                 0               0        0        Winter  No Holiday
3 -17.7                 0               0        0        Winter  No Holiday
4 -17.6                 0               0        0        Winter  No Holiday
5 -18.6                 0               0        0        Winter  No Holiday
6 -18.7                 0               0        0        Winter  No Holiday
  FUNCTIONING_DAY
1 Yes
2 Yes
3 Yes
4 Yes
5 Yes
6 Yes

In [4]:
# Create Table
dbWriteTable(conn,"world_cities",world_cities)
dbWriteTable(conn,"bike_sharing_systems",bike_sharing_systems)
dbWriteTable(conn,"cities_weather_forecast",cities_weather_forecast)
dbWriteTable(conn,"seoul_bike_sharing",seoul_bike_sharing)

ERROR: Error: Table world_cities exists in database, and both overwrite and append are FALSE

In [5]:
dbListTables(conn)

[1] "bike_sharing_systems"    "cities_weather_forecast"
[3] "seoul_bike_sharing"      "world_cities"


## Task 1 - Record Count
#### Determine how many records are in the seoul_bike_sharing dataset.

### Solution 1

In [6]:
# provide your solution here
dbGetQuery(conn, 'SELECT COUNT () FROM seoul_bike_sharing')

  COUNT ()
1 8465

## Task 2 - Operational Hours
#### Determine how many hours had non-zero rented bike count.

### Solution 2

In [10]:
# provide your solution here
dbGetQuery(conn, 'SELECT COUNT (HOUR) FROM seoul_bike_sharing WHERE RENTED_BIKE_COUNT > 0')

  COUNT (HOUR)
1 8465

## Task 3 - Weather Outlook
#### Query the the weather forecast for Seoul over the next 3 hours.
Recall that the records in the CITIES_WEATHER_FORECAST dataset are 3 hours apart, so we just need the first record from the query.

### Solution 3

In [ ]:
# provide your solution here

## Task 4 - Seasons
#### Find which seasons are included in the seoul bike sharing dataset.

### Solution 4

In [12]:
# provide your solution here
dbGetQuery(conn, 'SELECT DISTINCT SEASONS FROM seoul_bike_sharing')

  SEASONS
1 Winter
2 Spring
3 Summer
4 Autumn

## Task 5 - Date Range
#### Find the first and last dates in the Seoul Bike Sharing dataset.

### Solution 5

In [13]:
# provide your solution here
dbGetQuery(conn, 'SELECT min(DATE), max(DATE) FROM seoul_bike_sharing')

  min(DATE)  max(DATE)
1 01/01/2018 31/12/2017

## Task 6 - Subquery - 'all-time high'
#### determine which date and hour had the most bike rentals.

### Solution 6

In [20]:
# provide your solution here
dbGetQuery(conn, 'SELECT MAX(RENTED_BIKE_COUNT), DATE, HOUR FROM seoul_bike_sharing')

  MAX(RENTED_BIKE_COUNT) DATE       HOUR
1 3556                   19/06/2018 18

## Task 7 - Hourly popularity and temperature by season
#### Determine the average hourly temperature and the average number of bike rentals per hour over each season. List the top ten results by average bike count.

### Solution 7

In [ ]:
# provide your solution here

## Task 8 - Rental Seasonality
#### Find the average hourly bike count during each season. 
Also include the minimum, maximum, and standard deviation of the hourly bike count for each season. 

> Hint : Use the SQRT(AVG(col*col) - AVG(col)*AVG(col) ) function where col refers to your column name for finding the standard deviation

### Solution 8

In [ ]:
# provide your solution here

Let's explore a bit and see what might be the most significant contributing factors in terms of the provided data.

## Task 9 - Weather Seasonality
#### Consider the weather over each season. On average, what were the TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBILITY, DEW_POINT_TEMPERATURE, SOLAR_RADIATION, RAINFALL, and SNOWFALL per season?
Include the average bike count as well , and rank the results by average bike count so you can see if it is correlated with the weather at all.

### Solution 9

In [ ]:
# provide your solution here

## Task 10 - Total Bike Count and City Info for Seoul
#### Use an implicit join across the WORLD_CITIES and the BIKE_SHARING_SYSTEMS tables to determine the total number of bikes avaialble in Seoul, plus the following city information about Seoul: CITY, COUNTRY, LAT, LON, POPULATION, in a single view.
Notice that in this case, the CITY column will work for the WORLD_CITIES table, but in general you would have to use the CITY_ASCII column.

### Solution 10

In [ ]:
# provide your solution here

## Task 11 - Find all city names and coordinates with comparable bike scale to Seoul's bike sharing system
#### Find all cities with total bike counts between 15000 and 20000. Return the city and country names, plus the coordinates (LAT, LNG), population, and number of bicycles for each city.
Later we will ask you to visualize these similar cities on leaflet, with some weather data.

### Solution 11

In [ ]:
# provide your solution here

In [ ]:
close(conn)

## Author(s)

<h4> Jeff Grossman </h4>
<h4> Lakshmi Holla </h4>


## Other Contributor(s)

<h4>  Malika Singla </h4>

## Change log

| Date (YYYY-MM-DD) | Version | Changed By | Change Description                 |
| ----------------- | ------- | ---------- | ---------------------------------- |
| 2022-03-03        | 1.0     |Lakshmi Holla  | Created lab using sqlite3          |

## <h3 align="center"> © IBM Corporation 2022. All rights reserved. <h3/>